app/Http/Controllers/AdmiController.php

    public function index(Request $request)
    {
        if ($request->ajax()) {
            $admin =User::where('role',1)->get();
---
select * from `users` where `role` = 1