app/Http/Controllers/BookingController.php

select * from `bookings` where `estado` = 1
---
    public function index(Request $request)
    {
        //
        if ($request->ajax()) {
            $reservas=Booking::where('estado',1)->get();

select * from `bookings` where `estado` = 0
---
    public function realizadas(Request $request)
    {
        //
        if ($request->ajax()) {
            $reservas=Booking::where('estado',0)->get();