app/Http/Controllers/ClienteController.php

select * from `users` where `role` = 0
---
    public function index(Request $request)
    {
        if ($request->ajax()) {
            $clientes =User::where('role',0)->get();

select * from `users` where `users`.`id` = '11' limit 1
---
    public function edit($id)
    {

        $cliente = User::find($id);