app/Http/Controllers/CuponController.php

select * from `coupons` where `estado` = 1
---
    public function index(Request $request)
    {
        // vigentes
        if ($request->ajax()) {
            $cupones=Coupon::where('estado',1)->get();

select * from `coupons` where `estado` = 0
---
    public function consumidos(Request $request)
    {
        //vigentes
        if ($request->ajax()) {
            $cupones=Coupon::where('estado',0)->get();