app/Http/Controllers/InformeController.php

    public function index()
    {
        //
        $informes=Booking::where('estado',0)->get();
---
select * from `bookings` where `estado` = 0