app/Http/Controllers/InformeController.php

select * from `bookings`
---
    public function index(Request $request)
    {
        //informe mensual
        if ($request->ajax()) {
            $reservas=Booking::get();

select * from `bookings` where `estado` = 0
---
    public function informe_anual()
    {
        //
        $informes=Booking::where('estado',0)->get();