app/Http/Controllers/InmuebleController.php

    public function edit($id)
    {
        //
        $inmuebles = Propertie::find($id);
---
select * from `properties` where (`id` is null) limit 1