app/Http/Controllers/InmuebleController.php

    public function index(Request $request)
    {
        $provincias=Province::all();

        if ($request->ajax()) {
            $inmuebles=Propertie::where('estado',1)->get();
---
select * from `provinces`
select * from `properties` where `estado` = 1

    public function provincias($id)
    {
       $distritos=District::where('province_id',$id)->get();
---
select * from `districts` where `province_id` = '1'

    public function edit($id)
    {
        //
        $inmuebles = Propertie::find($id);
---
select * from `properties` where `properties`.`id` = '1' limit 1